app/views/orders/_order.json.jbuilder

json.price order.price
json.product order.order_summary.product_id
---
SELECT  "order_summaries".* FROM "order_summaries" WHERE "order_summaries"."order_id" = $1 LIMIT $2  [["order_id", 6], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"