app/controllers/addresses_controller.rb

  def create
    @address = Address.new(address_params)
    @address.user_id = current_user.id

    if @address.save
---
INSERT INTO "addresses" ("line1", "line2", "pin_code", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["line1", "C-551,Sheikh Sarai"], ["line2", "New Delhi"], ["pin_code", "110017"], ["user_id", 6], ["created_at", "2019-04-01 22:03:32.537927"], ["updated_at", "2019-04-01 22:03:32.537927"]]