app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 ORDER BY "orders"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def index
    @orders = current_user.orders

INSERT INTO "orders" ("user_id", "address_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 6], ["address_id", 1], ["created_at", "2019-04-02 08:23:04.129189"], ["updated_at", "2019-04-02 08:23:04.129189"]]
SELECT  "order_summaries".* FROM "order_summaries" WHERE "order_summaries"."order_id" = $1 LIMIT $2  [["order_id", 58], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 ORDER BY "orders"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
INSERT INTO "order_summaries" ("order_id", "product_id", "quantity", "payment_mode", "add_ons", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    @order.user_id = current_user.id
    #Here you're trying to save the order. if its successful, you now have and order_id.
    if @order.save
      #successful
      #Here you're just permitting the :order_summary key in the call. This *should* work. IIRC.
      params[:order_summary].permit!
      order_summary = OrderSummary.new(params[:order_summary])
      order_summary.order_id = @order.id
      order_summary.save