app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save

UPDATE "users" SET "is_verified" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_verified", "t"], ["updated_at", "2019-04-01 20:08:46.216803"], ["id", 6]]
---
  def check_verification
    request = Authy::PhoneVerification.check(verification_code:params[:verification_code], country_code:91, phone_number:current_user.email)
      if request.success?
      current_user.update(is_verified:true)